package com.example;

/*
Вариант №16: Возрастной ценз в кино.
1.  Разработайте функцию, которая принимает возраст зрителя и возрастной рейтинг фильма (0+, 6+, 12+, 16+, 18+).
Функция возвращает «разрешено» или «запрещено».
Также функция должна учитывать наличие сопровождающего взрослого (для рейтингов до 16+ включительно это снимает ограничения).
2.  Учтите обработку ошибок: возраст должен быть в диапазоне от 0 до 100 лет.
Рейтинг фильма должен быть из списка допустимых.
3.  Проверьте пограничные случаи (зрителю ровно 12 лет для рейтинга 12+),
влияние сопровождающего и некорректно введенный возраст.
* */

public class Main {
    public static void main(String[] args) {
    }
}